onitake/aversive/include/aversive/parts/AT90PWM2.h
/* PIM2 */
#define PEOPE2_REG           PIM2
#define PEVE2A_REG           PIM2
#define PEVE2B_REG           PIM2
#define PSEIE2_REG           PIM2

/* TCCR1A */
#define WGM10_REG            TCCR1A
#define WGM11_REG            TCCR1A
#define COM1B0_REG           TCCR1A
#define COM1B1_REG           TCCR1A
#define COM1A0_REG           TCCR1A
#define COM1A1_REG           TCCR1A

/* TCCR1C */
#define FOC1B_REG            TCCR1C
#define FOC1A_REG            TCCR1C

/* TCCR1B */
#define CS10_REG             TCCR1B
#define CS11_REG             TCCR1B
#define CS12_REG             TCCR1B
#define WGM12_REG            TCCR1B
#define WGM13_REG            TCCR1B
#define ICES1_REG            TCCR1B
#define ICNC1_REG            TCCR1B

/* OSCCAL */
#define CAL0_REG             OSCCAL
#define CAL1_REG             OSCCAL
#define CAL2_REG             OSCCAL
#define CAL3_REG             OSCCAL
#define CAL4_REG             OSCCAL
#define CAL5_REG             OSCCAL
#define CAL6_REG             OSCCAL

/* OCR0RAL */
#define OCR0RA_0_REG         OCR0RAL
#define OCR0RA_1_REG         OCR0RAL
#define OCR0RA_2_REG         OCR0RAL
#define OCR0RA_3_REG         OCR0RAL
#define OCR0RA_4_REG         OCR0RAL
#define OCR0RA_5_REG         OCR0RAL
#define OCR0RA_6_REG         OCR0RAL
#define OCR0RA_7_REG         OCR0RAL

/* GPIOR1 */
#define GPIOR10_REG          GPIOR1
#define GPIOR11_REG          GPIOR1
#define GPIOR12_REG          GPIOR1
#define GPIOR13_REG          GPIOR1
#define GPIOR14_REG          GPIOR1
#define GPIOR15_REG          GPIOR1
#define GPIOR16_REG          GPIOR1
#define GPIOR17_REG          GPIOR1

/* GPIOR0 */
#define GPIOR00_REG          GPIOR0
#define GPIOR01_REG          GPIOR0
#define GPIOR02_REG          GPIOR0
#define GPIOR03_REG          GPIOR0
#define GPIOR04_REG          GPIOR0
#define GPIOR05_REG          GPIOR0
#define GPIOR06_REG          GPIOR0
#define GPIOR07_REG          GPIOR0

/* GPIOR3 */
#define GPIOR30_REG          GPIOR3
#define GPIOR31_REG          GPIOR3
#define GPIOR32_REG          GPIOR3
#define GPIOR33_REG          GPIOR3
#define GPIOR34_REG          GPIOR3
#define GPIOR35_REG          GPIOR3
#define GPIOR36_REG          GPIOR3
#define GPIOR37_REG          GPIOR3

/* GPIOR2 */
#define GPIOR20_REG          GPIOR2
#define GPIOR21_REG          GPIOR2
#define GPIOR22_REG          GPIOR2
#define GPIOR23_REG          GPIOR2
#define GPIOR24_REG          GPIOR2
#define GPIOR25_REG          GPIOR2
#define GPIOR26_REG          GPIOR2
#define GPIOR27_REG          GPIOR2

/* PIFR0 */
#define PEOP0_REG            PIFR0
#define PRN00_REG            PIFR0
#define PRN01_REG            PIFR0
#define PEV0A_REG            PIFR0
#define PEV0B_REG            PIFR0
#define PSEI0_REG            PIFR0

/* DDRE */
#define DDE0_REG             DDRE
#define DDE1_REG             DDRE
#define DDE2_REG             DDRE

/* TCNT0 */
#define TCNT0_0_REG          TCNT0
#define TCNT0_1_REG          TCNT0
#define TCNT0_2_REG          TCNT0
#define TCNT0_3_REG          TCNT0
#define TCNT0_4_REG          TCNT0
#define TCNT0_5_REG          TCNT0
#define TCNT0_6_REG          TCNT0
#define TCNT0_7_REG          TCNT0

/* TCCR0B */
#define CS00_REG             TCCR0B
#define CS01_REG             TCCR0B
#define CS02_REG             TCCR0B
#define WGM02_REG            TCCR0B
#define FOC0B_REG            TCCR0B
#define FOC0A_REG            TCCR0B

/* TCCR0A */
#define WGM00_REG            TCCR0A
#define WGM01_REG            TCCR0A
#define COM0B0_REG           TCCR0A
#define COM0B1_REG           TCCR0A
#define COM0A0_REG           TCCR0A
#define COM0A1_REG           TCCR0A

/* PFRC2B */
#define PRFM2B0_REG          PFRC2B
#define PRFM2B1_REG          PFRC2B
#define PRFM2B2_REG          PFRC2B
#define PRFM2B3_REG          PFRC2B
#define PFLTE2B_REG          PFRC2B
#define PELEV2B_REG          PFRC2B
#define PISEL2B_REG          PFRC2B
#define PCAE2B_REG           PFRC2B

/* PFRC2A */
#define PRFM2A0_REG          PFRC2A
#define PRFM2A1_REG          PFRC2A
#define PRFM2A2_REG          PFRC2A
#define PRFM2A3_REG          PFRC2A
#define PFLTE2A_REG          PFRC2A
#define PELEV2A_REG          PFRC2A
#define PISEL2A_REG          PFRC2A
#define PCAE2A_REG           PFRC2A

/* OCR2SAL */
#define OCR2SA_0_REG         OCR2SAL
#define OCR2SA_1_REG         OCR2SAL
#define OCR2SA_2_REG         OCR2SAL
#define OCR2SA_3_REG         OCR2SAL
#define OCR2SA_4_REG         OCR2SAL
#define OCR2SA_5_REG         OCR2SAL
#define OCR2SA_6_REG         OCR2SAL
#define OCR2SA_7_REG         OCR2SAL

/* EUCSRA */
#define URxS0_REG            EUCSRA
#define URxS1_REG            EUCSRA
#define URxS2_REG            EUCSRA
#define URxS3_REG            EUCSRA
#define UTxS0_REG            EUCSRA
#define UTxS1_REG            EUCSRA
#define UTxS2_REG            EUCSRA
#define UTxS3_REG            EUCSRA

/* EUCSRB */
#define BODR_REG             EUCSRB
#define EMCH_REG             EUCSRB
#define EUSBS_REG            EUCSRB
#define EUSART_REG           EUCSRB

/* EUCSRC */
#define STP0_REG             EUCSRC
#define STP1_REG             EUCSRC
#define F1617_REG            EUCSRC
#define FEM_REG              EUCSRC

/* PCTL0 */
#define PRUN0_REG            PCTL0
#define PCCYC0_REG           PCTL0
#define PARUN0_REG           PCTL0
#define PAOC0A_REG           PCTL0
#define PAOC0B_REG           PCTL0
#define PBFM0_REG            PCTL0
#define PPRE00_REG           PCTL0
#define PPRE01_REG           PCTL0

/* PCTL2 */
#define PRUN2_REG            PCTL2
#define PCCYC2_REG           PCTL2
#define PARUN2_REG           PCTL2
#define PAOC2A_REG           PCTL2
#define PAOC2B_REG           PCTL2
#define PBFM2_REG            PCTL2
#define PPRE20_REG           PCTL2
#define PPRE21_REG           PCTL2

/* SPCR */
#define SPR0_REG             SPCR
#define SPR1_REG             SPCR
#define CPHA_REG             SPCR
#define CPOL_REG             SPCR
#define MSTR_REG             SPCR
#define DORD_REG             SPCR
#define SPE_REG              SPCR
#define SPIE_REG             SPCR

/* TIFR1 */
#define TOV1_REG             TIFR1
#define OCF1A_REG            TIFR1
#define OCF1B_REG            TIFR1
#define ICF1_REG             TIFR1

