onitake/aversive/include/aversive/parts/AT90PWM2.h
/* GTCCR */
#define PSR10_REG            GTCCR
#define ICPSEL1_REG          GTCCR
#define TSM_REG              GTCCR
#define PSRSYNC_REG          GTCCR

/* ICR1H */
#define ICR1H0_REG           ICR1H
#define ICR1H1_REG           ICR1H
#define ICR1H2_REG           ICR1H
#define ICR1H3_REG           ICR1H
#define ICR1H4_REG           ICR1H
#define ICR1H5_REG           ICR1H
#define ICR1H6_REG           ICR1H
#define ICR1H7_REG           ICR1H

/* POM2 */
#define POMV2A0_REG          POM2
#define POMV2A1_REG          POM2
#define POMV2A2_REG          POM2
#define POMV2A3_REG          POM2
#define POMV2B0_REG          POM2
#define POMV2B1_REG          POM2
#define POMV2B2_REG          POM2
#define POMV2B3_REG          POM2

/* OCR2RBL */
#define OCR2RB_0_REG         OCR2RBL
#define OCR2RB_1_REG         OCR2RBL
#define OCR2RB_2_REG         OCR2RBL
#define OCR2RB_3_REG         OCR2RBL
#define OCR2RB_4_REG         OCR2RBL
#define OCR2RB_5_REG         OCR2RBL
#define OCR2RB_6_REG         OCR2RBL
#define OCR2RB_7_REG         OCR2RBL

/* PICR2H */
#define PICR2_8_REG          PICR2H
#define PICR2_9_REG          PICR2H
#define PICR2_10_REG         PICR2H
#define PICR2_11_REG         PICR2H

/* OCR2RBH */
#define OCR2RB_8_REG         OCR2RBH
#define OCR2RB_9_REG         OCR2RBH
#define OCR2RB_10_REG        OCR2RBH
#define OCR2RB_11_REG        OCR2RBH
#define OCR2RB_12_REG        OCR2RBH
#define OCR2RB_13_REG        OCR2RBH
#define OCR2RB_14_REG        OCR2RBH
#define OCR2RB_15_REG        OCR2RBH

/* PICR2L */
#define PICR2_0_REG          PICR2L
#define PICR2_1_REG          PICR2L
#define PICR2_2_REG          PICR2L
#define PICR2_3_REG          PICR2L
#define PICR2_4_REG          PICR2L
#define PICR2_5_REG          PICR2L
#define PICR2_6_REG          PICR2L
#define PICR2_7_REG          PICR2L

/* OCR1BL */
#define OCR1BL0_REG          OCR1BL
#define OCR1BL1_REG          OCR1BL
#define OCR1BL2_REG          OCR1BL
#define OCR1BL3_REG          OCR1BL
#define OCR1BL4_REG          OCR1BL
#define OCR1BL5_REG          OCR1BL
#define OCR1BL6_REG          OCR1BL
#define OCR1BL7_REG          OCR1BL

/* OCR1BH */
#define OCR1BH0_REG          OCR1BH
#define OCR1BH1_REG          OCR1BH
#define OCR1BH2_REG          OCR1BH
#define OCR1BH3_REG          OCR1BH
#define OCR1BH4_REG          OCR1BH
#define OCR1BH5_REG          OCR1BH
#define OCR1BH6_REG          OCR1BH
#define OCR1BH7_REG          OCR1BH

/* ICR1L */
#define ICR1L0_REG           ICR1L
#define ICR1L1_REG           ICR1L
#define ICR1L2_REG           ICR1L
#define ICR1L3_REG           ICR1L
#define ICR1L4_REG           ICR1L
#define ICR1L5_REG           ICR1L
#define ICR1L6_REG           ICR1L
#define ICR1L7_REG           ICR1L

/* MCUSR */
#define PORF_REG             MCUSR
#define EXTRF_REG            MCUSR
#define BORF_REG             MCUSR
#define WDRF_REG             MCUSR

/* EECR */
#define EERE_REG             EECR
#define EEWE_REG             EECR
#define EEMWE_REG            EECR
#define EERIE_REG            EECR

/* SMCR */
#define SE_REG               SMCR
#define SM0_REG              SMCR
#define SM1_REG              SMCR
#define SM2_REG              SMCR

/* PLLCSR */
#define PLOCK_REG            PLLCSR
#define PLLE_REG             PLLCSR
#define PLLF_REG             PLLCSR

/* OCR2RAH */
#define OCR2RA_8_REG         OCR2RAH
#define OCR2RA_9_REG         OCR2RAH
#define OCR2RA_10_REG        OCR2RAH
#define OCR2RA_11_REG        OCR2RAH

/* OCR2RAL */
#define OCR2RA_0_REG         OCR2RAL
#define OCR2RA_1_REG         OCR2RAL
#define OCR2RA_2_REG         OCR2RAL
#define OCR2RA_3_REG         OCR2RAL
#define OCR2RA_4_REG         OCR2RAL
#define OCR2RA_5_REG         OCR2RAL
#define OCR2RA_6_REG         OCR2RAL
#define OCR2RA_7_REG         OCR2RAL

/* OCR0RBL */
#define OCR0RB_0_REG         OCR0RBL
#define OCR0RB_1_REG         OCR0RBL
#define OCR0RB_2_REG         OCR0RBL
#define OCR0RB_3_REG         OCR0RBL
#define OCR0RB_4_REG         OCR0RBL
#define OCR0RB_5_REG         OCR0RBL
#define OCR0RB_6_REG         OCR0RBL
#define OCR0RB_7_REG         OCR0RBL

/* OCR0SAH */
#define OCR0SA_8_REG         OCR0SAH
#define OCR0SA_9_REG         OCR0SAH
#define OCR0SA_00_REG        OCR0SAH
#define OCR0SA_01_REG        OCR0SAH

/* EEARH */
#define EEAR8_REG            EEARH
#define EEAR9_REG            EEARH
#define EEAR10_REG           EEARH
#define EEAR11_REG           EEARH

/* EEARL */
#define EEARL0_REG           EEARL
#define EEARL1_REG           EEARL
#define EEARL2_REG           EEARL
#define EEARL3_REG           EEARL
#define EEARL4_REG           EEARL
#define EEARL5_REG           EEARL
#define EEARL6_REG           EEARL
#define EEARL7_REG           EEARL

/* MCUCR */
#define IVCE_REG             MCUCR
#define IVSEL_REG            MCUCR
#define PUD_REG              MCUCR
#define SPIPS_REG            MCUCR

/* PICR0H */
#define PICR0_8_REG          PICR0H
#define PICR0_9_REG          PICR0H
#define PICR0_10_REG         PICR0H
#define PICR0_11_REG         PICR0H

/* EIFR */
#define INTF0_REG            EIFR
#define INTF1_REG            EIFR
#define INTF2_REG            EIFR

/* MUBRRL */
#define MUBRR0_REG           MUBRRL
#define MUBRR1_REG           MUBRRL
#define MUBRR2_REG           MUBRRL
#define MUBRR3_REG           MUBRRL
#define MUBRR4_REG           MUBRRL
#define MUBRR5_REG           MUBRRL
#define MUBRR6_REG           MUBRRL
#define MUBRR7_REG           MUBRRL

/* MUBRRH */
#define MUBRR8_REG           MUBRRH
#define MUBRR9_REG           MUBRRH
#define MUBRR10_REG          MUBRRH
#define MUBRR11_REG          MUBRRH
#define MUBRR12_REG          MUBRRH
#define MUBRR13_REG          MUBRRH
#define MUBRR14_REG          MUBRRH
#define MUBRR15_REG          MUBRRH

/* OCR2SAH */
#define OCR2SA_8_REG         OCR2SAH
#define OCR2SA_9_REG         OCR2SAH
#define OCR2SA_10_REG        OCR2SAH
#define OCR2SA_11_REG        OCR2SAH

/* OCR0SBL */
#define OCR0SB_0_REG         OCR0SBL
#define OCR0SB_1_REG         OCR0SBL
#define OCR0SB_2_REG         OCR0SBL
#define OCR0SB_3_REG         OCR0SBL
#define OCR0SB_4_REG         OCR0SBL
#define OCR0SB_5_REG         OCR0SBL
#define OCR0SB_6_REG         OCR0SBL
#define OCR0SB_7_REG         OCR0SBL

/* OCR0SBH */
#define OCR0SB_8_REG         OCR0SBH
#define OCR0SB_9_REG         OCR0SBH
#define OCR0SB_00_REG        OCR0SBH
#define OCR0SB_01_REG        OCR0SBH

/* PICR0L */
#define PICR0_0_REG          PICR0L
#define PICR0_1_REG          PICR0L
#define PICR0_2_REG          PICR0L
#define PICR0_3_REG          PICR0L
#define PICR0_4_REG          PICR0L
#define PICR0_5_REG          PICR0L
#define PICR0_6_REG          PICR0L
#define PICR0_7_REG          PICR0L

/* ADCSRA */
#define ADPS0_REG            ADCSRA
#define ADPS1_REG            ADCSRA
#define ADPS2_REG            ADCSRA
#define ADIE_REG             ADCSRA
#define ADIF_REG             ADCSRA
#define ADATE_REG            ADCSRA
#define ADSC_REG             ADCSRA
#define ADEN_REG             ADCSRA

/* PSOC0 */
#define POEN0A_REG           PSOC0
#define POEN0B_REG           PSOC0
#define PSYNC00_REG          PSOC0
#define PSYNC01_REG          PSOC0

/* ADCSRB */
#define ADTS0_REG            ADCSRB
#define ADTS1_REG            ADCSRB
#define ADTS2_REG            ADCSRB
#define ADTS3_REG            ADCSRB
#define ADASCR_REG           ADCSRB
#define ADHSM_REG            ADCSRB

/* OCR0A */
/* #define OCR0_0_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_1_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_2_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_3_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_4_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_5_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_6_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_7_REG           OCR0A */ /* dup in OCR0B */

