onitake/aversive/include/aversive/parts/AT90PWM2.h
#define ADC7_PORT PORTB
#define ADC7_BIT 6
#define PSCOUT11_PORT PORTB
#define PSCOUT11_BIT 6
#define ICP1B_PORT PORTB
#define ICP1B_BIT 6

#define ADC4_PORT PORTB
#define ADC4_BIT 7
#define PSCOUT01_PORT PORTB
#define PSCOUT01_BIT 7
#define SCK_PORT PORTB
#define SCK_BIT 7

#define PSCOUT00_PORT PORTD
#define PSCOUT00_BIT 0
#define XCK_PORT PORTD
#define XCK_BIT 0
#define SSA_PORT PORTD
#define SSA_BIT 0

#define PSCIN0_PORT PORTD
#define PSCIN0_BIT 1
#define CLK0_PORT PORTD
#define CLK0_BIT 1

#define PSCIN2_PORT PORTD
#define PSCIN2_BIT 2
#define OC1A_PORT PORTD
#define OC1A_BIT 2
#define MISO_A_PORT PORTD
#define MISO_A_BIT 2

#define TXD_PORT PORTD
#define TXD_BIT 3
#define DALI_PORT PORTD
#define DALI_BIT 3
#define OC0A_PORT PORTD
#define OC0A_BIT 3
#define SS_PORT PORTD
#define SS_BIT 3
#define MOSI_A_PORT PORTD
#define MOSI_A_BIT 3

#define ADC1_PORT PORTD
#define ADC1_BIT 4
#define RXD_PORT PORTD
#define RXD_BIT 4
#define DALI_PORT PORTD
#define DALI_BIT 4
#define ICP1_PORT PORTD
#define ICP1_BIT 4
#define SCK_A_PORT PORTD
#define SCK_A_BIT 4

#define ADC2_PORT PORTD
#define ADC2_BIT 5
#define ACMP2_PORT PORTD
#define ACMP2_BIT 5

#define ADC3_PORT PORTD
#define ADC3_BIT 6
#define ACMPM_PORT PORTD
#define ACMPM_BIT 6
#define INT0_PORT PORTD
#define INT0_BIT 6

#define ACMP0_PORT PORTD
#define ACMP0_BIT 7

#define RESET_PORT PORTE
#define RESET_BIT 0
#define OCD_PORT PORTE
#define OCD_BIT 0

#define OC0B_PORT PORTE
#define OC0B_BIT 1
#define XTAL1_PORT PORTE
#define XTAL1_BIT 1

#define ADC0_PORT PORTE
#define ADC0_BIT 2
#define XTAL2_PORT PORTE
#define XTAL2_BIT 2


